define(function (require) {
    var ret = {};

    //
    ret.getGridData = function () {
        return [
            { ID: 1, aa: '01', bb: '锻', cc: '1', dd: '1.锻造;2.正火', ee: '外协', ff: '', gg: '0.00', hh: '0.00', ii: '', jj: 'ITEM2012050000000001', kk: '6000', ll: '' },
            { ID: 1, aa: '02', bb: '锻', cc: '1', dd: '1.锻造;2.正火', ee: '外协', ff: '', gg: '0.00', hh: '0.00', ii: '', jj: 'ITEM2012050000000001', kk: '6000', ll: '' },
            { ID: 1, aa: '03', bb: '锻', cc: '1', dd: '1.锻造;2.正火', ee: '外协', ff: '', gg: '0.00', hh: '0.00', ii: '', jj: 'ITEM2012050000000001', kk: '6000', ll: '' },
            { ID: 1, aa: '04', bb: '锻', cc: '1', dd: '1.锻造;2.正火', ee: '外协', ff: '', gg: '0.00', hh: '0.00', ii: '', jj: 'ITEM2012050000000001', kk: '6000', ll: '' },
            { ID: 1, aa: '05', bb: '锻', cc: '1', dd: '1.锻造;2.正火', ee: '外协', ff: '', gg: '0.00', hh: '0.00', ii: '', jj: 'ITEM2012050000000001', kk: '6000', ll: '' },
            { ID: 1, aa: '06', bb: '锻', cc: '1', dd: '1.锻造;2.正火', ee: '外协', ff: '', gg: '0.00', hh: '0.00', ii: '', jj: 'ITEM2012050000000001', kk: '6000', ll: '' }
        ]
    }

    ret.reGetGridData = function () {
        return [
            { ID: 1, aa: '01', bb: '锻', cc: '1', dd: '1.锻造;2.正火', ee: '外协', ff: '', gg: '0.00', hh: '0.00', ii: '', jj: 'ITEM2012050000000001', kk: '6000', ll: '' },
            { ID: 1, aa: '02', bb: '锻', cc: '1', dd: '1.锻造;2.正火', ee: '外协', ff: '', gg: '0.00', hh: '0.00', ii: '', jj: 'ITEM2012050000000001', kk: '6000', ll: '' }
        ]
    }

    return ret;
})