define(function (require) {
    var ret = {};

    //
    ret.getGridData = function () {
        return [
            { ID: 1, aa: '图纸A1', bb: '齐全', cc: '齐全', dd: '', ee: '', ff: '', gg: '生效', hh: '2014JK0859', ii: '加工合同', jj: '7000', kk: '6000', ll: '' },
            { ID: 2, aa: '图纸A2', bb: '齐全', cc: '齐全', dd: '', ee: '', ff: '', gg: '生效', hh: '2014JK0859', ii: '加工合同', jj: '7000', kk: '6000', ll: '' },
            { ID: 3, aa: '图纸B1', bb: '齐全', cc: '齐全', dd: '', ee: '', ff: '', gg: '生效', hh: '2014JK0859', ii: '加工合同', jj: '7000', kk: '6000', ll: '' },
            { ID: 4, aa: '图纸B2', bb: '齐全', cc: '齐全', dd: '', ee: '', ff: '', gg: '生效', hh: '2014JK0859', ii: '加工合同', jj: '7000', kk: '6000', ll: '' },
            { ID: 5, aa: '图纸C1', bb: '齐全', cc: '齐全', dd: '', ee: '', ff: '', gg: '生效', hh: '2014JK0859', ii: '加工合同', jj: '7000', kk: '6000', ll: '' },
            { ID: 6, aa: '图纸C2', bb: '齐全', cc: '齐全', dd: '', ee: '', ff: '', gg: '生效', hh: '2014JK0859', ii: '加工合同', jj: '7000', kk: '6000', ll: '' },
            { ID: 1, aa: '图纸D1', bb: '齐全', cc: '齐全', dd: '', ee: '', ff: '', gg: '生效', hh: '2014JK0859', ii: '加工合同', jj: '7000', kk: '6000', ll: '' },
            { ID: 2, aa: '图纸D2', bb: '齐全', cc: '齐全', dd: '', ee: '', ff: '', gg: '生效', hh: '2014JK0859', ii: '加工合同', jj: '7000', kk: '6000', ll: '' },
            { ID: 3, aa: '图纸E1', bb: '齐全', cc: '齐全', dd: '', ee: '', ff: '', gg: '生效', hh: '2014JK0859', ii: '加工合同', jj: '7000', kk: '6000', ll: '' },
            { ID: 4, aa: '图纸E2', bb: '齐全', cc: '齐全', dd: '', ee: '', ff: '', gg: '生效', hh: '2014JK0859', ii: '加工合同', jj: '7000', kk: '6000', ll: '' },
            { ID: 5, aa: '图纸F1', bb: '齐全', cc: '齐全', dd: '', ee: '', ff: '', gg: '生效', hh: '2014JK0859', ii: '加工合同', jj: '7000', kk: '6000', ll: '' },
            { ID: 6, aa: '图纸F2', bb: '齐全', cc: '齐全', dd: '', ee: '', ff: '', gg: '生效', hh: '2014JK0859', ii: '加工合同', jj: '7000', kk: '6000', ll: '' }
        ]
    }

    ret.reGetGridData = function () {
        return [
            { ID: 1, aa: '图纸A1', bb: '齐全', cc: '齐全', dd: '', ee: '', ff: '', gg: '生效', hh: '2014JK0859', ii: '加工合同', jj: '7000', kk: '6000', ll: '' },
            { ID: 2, aa: '图纸A2', bb: '齐全', cc: '齐全', dd: '', ee: '', ff: '', gg: '生效', hh: '2014JK0859', ii: '加工合同', jj: '7000', kk: '6000', ll: '' }
        ]
    }

    return ret;
})