define(function (require) {
    var ret = {};

    //
    ret.getGridData = function () {
        return [
            { ID: 1, aa: '2014I6480399', bb: '0003455', cc: '断栅', dd: 'A1', ee: 'A2', ff: 'Rs-EL2-01', gg: 'A', hh: '高尚', ii: '2014/06/20 08:45:59.000', jj: '星儿', kk: '质量检验部', ll: '' },
            { ID: 2, aa: '2014I6480399', bb: '0003455', cc: '断栅', dd: 'A1', ee: 'A2', ff: 'Rs-EL2-01', gg: 'A', hh: '高尚', ii: '2014/06/20 08:45:59.000', jj: '星儿', kk: '质量检验部', ll: '' },
            { ID: 3, aa: '2014I6480399', bb: '0003455', cc: '断栅', dd: 'A1', ee: 'A2', ff: 'Rs-EL2-01', gg: 'A', hh: '高尚', ii: '2014/06/20 08:45:59.000', jj: '星儿', kk: '质量检验部', ll: '' },
            { ID: 4, aa: '2014I6480399', bb: '0003455', cc: '断栅', dd: 'A1', ee: 'A2', ff: 'Rs-EL2-01', gg: 'A', hh: '高尚', ii: '2014/06/20 08:45:59.000', jj: '星儿', kk: '质量检验部', ll: '' },
            { ID: 5, aa: '2014I6480399', bb: '0003455', cc: '断栅', dd: 'A1', ee: 'A2', ff: 'Rs-EL2-01', gg: 'A', hh: '高尚', ii: '2014/06/20 08:45:59.000', jj: '星儿', kk: '质量检验部', ll: '' },
            { ID: 6, aa: '2014I6480399', bb: '0003455', cc: '断栅', dd: 'A1', ee: 'A2', ff: 'Rs-EL2-01', gg: 'A', hh: '高尚', ii: '2014/06/20 08:45:59.000', jj: '星儿', kk: '质量检验部', ll: '' },
            { ID: '', aa: '', bb: '', cc: '', dd: '', ee: '', ff: '', gg: '', hh: '', ii: '', jj: '', kk: '', ll: '' },
            { ID: '', aa: '', bb: '', cc: '', dd: '', ee: '', ff: '', gg: '', hh: '', ii: '', jj: '', kk: '', ll: '' },
            { ID: '', aa: '', bb: '', cc: '', dd: '', ee: '', ff: '', gg: '', hh: '', ii: '', jj: '', kk: '', ll: '' }
        ]
    }

    ret.reGetGridData = function () {
        return [
            { ID: 1, aa: '2014I6480399', bb: '0003455', cc: '断栅', dd: 'A1', ee: 'A2', ff: 'Rs-EL2-01', gg: 'A', hh: '高尚', ii: '2014/06/20 08:45:59.000', jj: '星儿', kk: '质量检验部', ll: '' },
            { ID: 2, aa: '2014I6480399', bb: '0003455', cc: '断栅', dd: 'A1', ee: 'A2', ff: 'Rs-EL2-01', gg: 'A', hh: '高尚', ii: '2014/06/20 08:45:59.000', jj: '星儿', kk: '质量检验部', ll: '' }
        ]
    }

    return ret;
})