define(function (require) {
    var ret = {};

    //
    ret.getGridData = function () {
        return [
            { ID: 1, aa: '17CH0005B-002', bb: '无库存', cc: '车间加工【半精车】', dd: '暂无', ee: '', ff: '', gg: '生效', hh: '2014JK0859', ii: '加工合同', jj: '7000', kk: '6000', ll: '' },
            { ID: 2, aa: '17CH0005B-002', bb: '无库存', cc: '车间加工【半精车】', dd: '暂无', ee: '', ff: '', gg: '生效', hh: '2014JK0859', ii: '加工合同', jj: '7000', kk: '6000', ll: '' },
            { ID: 3, aa: '17CH0005B-002', bb: '无库存', cc: '车间加工【半精车】', dd: '暂无', ee: '', ff: '', gg: '生效', hh: '2014JK0859', ii: '加工合同', jj: '7000', kk: '6000', ll: '' },
            { ID: 4, aa: '17CH0005B-002', bb: '无库存', cc: '车间加工【半精车】', dd: '暂无', ee: '', ff: '', gg: '生效', hh: '2014JK0859', ii: '加工合同', jj: '7000', kk: '6000', ll: '' },
            { ID: 5, aa: '17CH0005B-002', bb: '无库存', cc: '车间加工【半精车】', dd: '暂无', ee: '', ff: '', gg: '生效', hh: '2014JK0859', ii: '加工合同', jj: '7000', kk: '6000', ll: '' },
            { ID: 6, aa: '17CH0005B-002', bb: '无库存', cc: '车间加工【半精车】', dd: '暂无', ee: '', ff: '', gg: '生效', hh: '2014JK0859', ii: '加工合同', jj: '7000', kk: '6000', ll: '' },
            { ID: '', aa: '', bb: '', cc: '', dd: '', ee: '', ff: '', gg: '', hh: '', ii: '', jj: '', kk: '', ll: '' },
            { ID: '', aa: '', bb: '', cc: '', dd: '', ee: '', ff: '', gg: '', hh: '', ii: '', jj: '', kk: '', ll: '' },
            { ID: '', aa: '', bb: '', cc: '', dd: '', ee: '', ff: '', gg: '', hh: '', ii: '', jj: '', kk: '', ll: '' }
        ]
    }

    ret.reGetGridData = function () {
        return [
            { ID: 1, aa: '17CH0005B-002', bb: '无库存', cc: '车间加工【半精车】', dd: '暂无', ee: '', ff: '', gg: '生效', hh: '2014JK0859', ii: '加工合同', jj: '7000', kk: '6000', ll: '' },
            { ID: 2, aa: '17CH0005B-002', bb: '无库存', cc: '车间加工【半精车】', dd: '暂无', ee: '', ff: '', gg: '生效', hh: '2014JK0859', ii: '加工合同', jj: '7000', kk: '6000', ll: '' },
        ]
    }

    return ret;
})